Repository: SynaestheticSynthesis/CompAnIon
Catalog: lib/l10n/app_*.arb
Languages: el

# menuEmotionCheckIn
source: Emotion Check-In
el: Καταγραφή Συναισθήματος

# menuRememberMe
source: Remember Me
el: Θυμάμαι εσένα

# menuPalliativeCare
source: Palliative Care
el: Ανακουφιστική Φροντίδα

# infoTooltip
source: What is this?
el: Τι είναι αυτό;

# onboardingWelcomeTitle
source: Welcome to CompAnIon!
el: Καλώς ήρθες στο CompAnIon!

# onboardingWelcomeDesc
source: This is not just an app. It is a presence, a companion, a space for your truth. Take a breath and notice: you hold a tool for self-connection, not just productivity.
el: Αυτή δεν είναι απλώς μια εφαρμογή. Είναι μια παρουσία, ένας σύντροφος, ένας χώρος για την αλήθεια σου. Πάρε μια ανάσα και παρατήρησε: κρατάς ένα εργαλείο για σύνδεση με τον εαυτό σου, όχι απλώς για παραγωγικότητα.

# onboardingEmotionTitle
source: Emotion Check-In
el: Καταγραφή Συναισθήματος

# onboardingEmotionDesc
source: Here, you record how you feel. Pause, reflect, and let yourself be honest. Every emotion is valid. CompAnIon listens, never judges.
el: Εδώ, καταγράφεις πώς νιώθεις. Σταμάτα, στοχάσου, και επέτρεψε στον εαυτό σου να είναι ειλικρινής. Κάθε συναίσθημα είναι έγκυρο. Το CompAnIon ακούει, ποτέ δεν κρίνει.

# onboardingReflectionTitle
source: Reflection Mode
el: Λειτουργία Στοχασμού

# onboardingReflectionDesc
source: After each check-in, you are invited to reflect. These questions are not tests—they are invitations to deeper understanding. Take your time.
el: Μετά από κάθε καταγραφή, προσκαλείσαι να στοχαστείς. Αυτές οι ερωτήσεις δεν είναι τεστ—είναι προσκλήσεις για βαθύτερη κατανόηση. Πάρε τον χρόνο σου.

# onboardingRememberTitle
source: Remember Me
el: Θυμάμαι Εσένα

# onboardingRememberDesc
source: Honor loved ones, remember special dates, and keep memories alive. This is a space for tribute, gratitude, and gentle remembrance.
el: Τίμησε αγαπημένους, θυμήσου ειδικές ημερομηνίες, και κράτα τις αναμνήσεις ζωντανές. Αυτός είναι ένας χώρος για φόρο τιμής, ευγνωμοσύνη, και τρυφερή ανάμνηση.

# onboardingPalliativeTitle
source: Palliative Care
el: Ανακουφιστική Φροντίδα

# onboardingPalliativeDesc
source: Find support and resources for serious diagnoses and emotional needs. CompAnIon is here for every moment, including the difficult ones.
el: Βρες υποστήριξη και πόρους για σοβαρές διαγνώσεις και συναισθηματικές ανάγκες. Το CompAnIon είναι εδώ για κάθε στιγμή, συμπεριλαμβανομένων των δύσκολων.

# onboardingSettingsTitle
source: Settings & Privacy
el: Ρυθμίσεις & Ιδιωτικότητα

# onboardingSettingsDesc
source: All data stays on your device. You choose your language, theme, and Care Mode. Privacy and dignity are at the heart of CompAnIon.
el: Όλα τα δεδομένα μένουν στη συσκευή σου. Επιλέγεις τη γλώσσα, το θέμα, και τη Λειτουργία Φροντίδας. Η ιδιωτικότητα και η αξιοπρέπεια βρίσκονται στην καρδιά του CompAnIon.

# onboardingFinalTitle
source: A Final Thought
el: Μια Τελική Σκέψη

# onboardingFinalDesc
source: CompAnIon is built on empathy, presence, and respect. As you begin, ask yourself: “What do I need most right now?” This companion is here to help you remember, reflect, and feel less alone.
el: Το CompAnIon είναι χτισμένο πάνω στην ενσυναίσθηση, την παρουσία, και τον σεβασμό. Καθώς ξεκινάς, ρώτα τον εαυτό σου: “Τι χρειάζομαι περισσότερο αυτή τη στιγμή;” Αυτός ο σύντροφος είναι εδώ για να σε βοηθήσει να θυμηθείς, να στοχαστείς, και να νιώσεις λιγότερο μόνος/η.

source: Start
el: Έναρξη

# helpEmotionCheckIn
source: This is your space to notice and record how you feel. Every emotion matters. CompAnIon is here to listen, not judge. Take a moment to reflect and honor your truth.
el: Αυτός είναι ο χώρος σου για να παρατηρήσεις και να καταγράψεις πώς νιώθεις. Κάθε συναίσθημα έχει σημασία. Το CompAnIon είναι εδώ για να ακούσει, όχι να κρίνει. Πάρε μια στιγμή για να στοχαστείς και να τιμήσεις την αλήθεια σου.

# helpRememberMe
source: Here you can honor loved ones, remember special dates, and keep memories alive. Tribute and gratitude are at the heart of this space.
el: Εδώ μπορείς να τιμήσεις αγαπημένους, να θυμηθείς ειδικές ημερομηνίες, και να κρατήσεις τις αναμνήσεις ζωντανές. Ο φόρος τιμής και η ευγνωμοσύνη βρίσκονται στην καρδιά αυτού του χώρου.

# helpPalliativeCare
source: Find support and resources for serious diagnoses and emotional needs. CompAnIon offers presence and care, even in difficult times.
el: Βρες υποστήριξη και πόρους για σοβαρές διαγνώσεις και συναισθηματικές ανάγκες. Το CompAnIon προσφέρει παρουσία και φροντίδα, ακόμα και σε δύσκολες στιγμές.

# helpSettings
source: Customize your experience: language, theme, font, and Care Mode. Privacy is sacred—your data stays on your device.
el: Προσάρμοσε την εμπειρία σου: γλώσσα, θέμα, γραμματοσειρά, και Λειτουργία Φροντίδας. Η ιδιωτικότητα είναι ιερή—τα δεδομένα σου μένουν στη συσκευή σου.

# helpDefault
source: A mindful, emotionally intelligent companion. Here to help you reconnect with yourself.
el: Ένας ενσυνείδητος, συναισθηματικά ευφυής σύντροφος. Εδώ για να σε βοηθήσει να επανασυνδεθείς με τον εαυτό σου.

# welcomeMessageEmpty
source: Welcome! How are you feeling right now?
el: Καλώς ήρθες! Πώς νιώθεις αυτή τη στιγμή;

# welcomeMessagePositive
source: Glad to see you back in a positive mood! How do you feel now?
el: Χαίρομαι που επιστρέφεις με θετική διάθεση! Πώς νιώθεις τώρα;

# welcomeMessageNegative
source: I'm here for you, whatever you feel. How are you today?
el: Είμαι εδώ για σένα, ό,τι κι αν νιώθεις. Πώς είσαι σήμερα;

# welcomeMessageNeutral
source: Notice how you feel right now, no pressure.
el: Παρατήρησε πώς νιώθεις αυτή τη στιγμή, χωρίς πίεση.

# welcomeMessageMixed
source: Feelings change. How are you now?
el: Τα συναισθήματα αλλάζουν. Πώς είσαι τώρα;

source: Record Emotion
el: Καταγραφή

# addCommentOptional
source: Add a comment (optional)
el: Πρόσθεσε σχόλιο (προαιρετικά)

source: Emotion History:
el: Ιστορικό Συναισθημάτων

source: Clear All
el: Καθαρισμός όλων

source: Export history (CSV)
el: Εξαγωγή Ιστορικού (CSV)

source: Share history (CSV)
el: Κοινή χρήση Ιστορικού (CSV)

source: Preview CSV
el: Προεπισκόπηση CSV

source: Stats:
el: Στατιστικά

source: Close
el: Κλείσιμο

source: Save
el: Αποθήκευση

source: Cancel
el: Άκυρο

source: Next
el: Επόμενο

source: Previous
el: Προηγούμενο

source: Reflection saved!
el: Το reflection αποθηκεύτηκε!

source: No history to export.
el: Δεν υπάρχει ιστορικό για εξαγωγή.

source: No history to preview.
el: Δεν υπάρχει ιστορικό για προεπισκόπηση.

# filteredHistoryExported
source: Filtered history exported to: {filePath}
el: Το φιλτραρισμένο ιστορικό εξήχθη στο: {filePath}

# errorExporting
source: Error exporting: {error}
el: Σφάλμα κατά την εξαγωγή: {error}

# themeLight
source: Switch to Light Theme
el: Μετάβαση σε ανοιχτό θέμα

# themeDark
source: Switch to Dark Theme
el: Μετάβαση σε σκοτεινό θέμα

source: Settings
el: Ρυθμίσεις

source: Language
el: Γλώσσα

source: Add Reminder
el: Προσθήκη υπενθύμισης

source: In Memory
el: Στη μνήμη

source: Special Day
el: Ειδική Ημέρα

source: Call
el: Τηλέφωνο

source: Write
el: Γράψε

# lightCandle
source: Light a candle
el: Άναψε κερί

source: Remember silently
el: Θυμήσου σιωπηλά

# noSpecialDatesToday
source: No special dates today. Add a loved one to remember.
el: Δεν υπάρχουν ειδικές ημερομηνίες σήμερα. Μια καλή μέρα για να είσαι παρών/ούσα.

source: All Reminders:
el: Όλες οι Υπενθυμίσεις

source: Comment
el: Σχόλιο

source: Emotion
el: Συναίσθημα

source: Your answer...
el: Η απάντησή σου...

# fillAnswerToContinue
source: Please fill in your answer to continue.
el: Συμπλήρωσε την απάντηση για να συνεχίσεις.

source: Save Reflection
el: Αποθήκευση Reflection

source: Reflection
el: Στοχασμός

source: Happy
el: Χαρούμενος/η

source: Sad
el: Λυπημένος/η

source: Angry
el: Θυμωμένος/η

source: Anxious
el: Αγχωμένος/η

source: Neutral
el: Ουδέτερος/η

source: Excited
el: Ενθουσιασμένος/η

source: Disappointed
el: Απογοητευμένος/η

# contextPrompt
source: How are you feeling right now?
el: Πώς νιώθεις αυτή τη στιγμή;

# contextPromptMorning
source: Good morning! How do you feel as you start your day?
el: Καλημέρα! Πώς νιώθεις ξεκινώντας τη μέρα;

# contextPromptEvening
source: Evenings are for reflection. How are you feeling tonight?
el: Τα βράδια είναι για στοχασμό. Πώς νιώθεις απόψε;

source: At work
el: Στη δουλειά

source: At home
el: Στο σπίτι

# weatherRainy
source: It's rainy outside. Does the weather affect your mood?
el: Βρέχει έξω. Σε επηρεάζει ο καιρός;

# greetingMorning
source: 🌅 Good morning, friend!
el: 🌅 Καλημέρα, φίλε/η!

# greetingAfternoon
source: 🌞 Good afternoon, friend!
el: 🌞 Καλό απόγευμα, φίλε/η!

# greetingEvening
source: 🌙 Good evening, friend!
el: 🌙 Καλό βράδυ, φίλε/η!

# greetingNight
source: 🌌 Night is here. How are you?
el: 🌌 Η νύχτα είναι εδώ. Πώς είσαι;

# greetingDefault
source: Hello, friend!
el: Γεια σου, φίλε/η!

source: Select emotion
el: Επίλεξε Συναίσθημα

source: Search reminders
el: Αναζήτηση υπενθυμίσεων

source: Edit
el: Επεξεργασία

source: Delete
el: Διαγραφή

source: Font
el: Γραμματοσειρά

source: Theme
el: Θέμα

source: Gender
el: Φύλο

# genderNeutral
source: Neutral
el: Ουδέτερο

# genderFemale
source: Female
el: Θηλυκό

# genderMale
source: Male
el: Αρσενικό

# languageEnglish
source: English
el: Αγγλικά

# languageGreek
source: Greek
el: Ελληνικά

source: Import Reminders
el: Εισαγωγή υπενθυμίσεων

# feedbackMorning
source: The start of the day is a chance for new energy.
el: Η αρχή της μέρας είναι ευκαιρία για νέα ενέργεια.

# feedbackRainy
source: Rain brings renewal. How do you feel about the weather today?
el: Η βροχή φέρνει ανανέωση. Πώς νιώθεις με τον καιρό σήμερα;

# feedbackStreakPositive
source: I see you often feel happy. What helps you keep this mood?
el: Βλέπω ότι νιώθεις συχνά χαρούμενος/η. Τι σε βοηθά να διατηρείς αυτή τη διάθεση;

# feedbackStreakNegative
source: You've felt sad several times. Would you like to share what's on your mind or try something new?
el: Έχεις νιώσει λυπημένος/η αρκετές φορές. Θέλεις να μοιραστείς τι σε απασχολεί ή να δοκιμάσεις κάτι νέο;

# feedbackStreakAngry
source: Anger is normal. Maybe a walk or a deep breath could help?
el: Ο θυμός είναι φυσιολογικός. Μήπως μια μικρή βόλτα ή βαθιά ανάσα βοηθήσει;

# feedbackStreakAnxious
source: Anxiety appears often. Would you like to try a relaxation technique?
el: Το άγχος εμφανίζεται συχνά. Θέλεις να δοκιμάσεις μια τεχνική χαλάρωσης;

# feedbackRecentChange
source: I notice a change in your feelings. Would you like to share what happened?
el: Παρατηρώ μια αλλαγή στα συναισθήματά σου. Θέλεις να μοιραστείς τι συνέβη;

# feedbackEveningSad
source: Evenings are hard for many. Maybe writing a few words or talking to someone could help?
el: Τα βράδια είναι δύσκολα για πολλούς. Μήπως βοηθά να γράψεις λίγα λόγια ή να μιλήσεις σε κάποιον;

# feedbackSunnyNeutral
source: The sun outside might bring a small change in mood. Want to go out for a bit?
el: Ο ήλιος έξω μπορεί να φέρει μια μικρή αλλαγή στη διάθεση. Θέλεις να βγεις για λίγο;

# feedbackPattern
source: There's a pattern in your feelings. Maybe it's time for a small change?
el: Παρατηρείται μοτίβο στα συναισθήματά σου. Μήπως ήρθε η ώρα για μια μικρή αλλαγή;

# feedbackHumanTouch
source: Whatever you feel, I'm here for you. Every emotion matters.
el: Ό,τι κι αν νιώθεις, είμαι εδώ για σένα. Κάθε συναίσθημα έχει αξία.
